Repository: queoGmbH/Shel.Neos.ImageChecker
Catalog: Resources/Private/Translations/*/Main.xlf
Languages: de

# checks.hasWarnings
source: The asset didn't pass all checks
de: Die Datei hat nicht alle Prüfungen bestanden

# checks.valid
source: The asset passed all checks
de: Die Datei hat alle Prüfungen bestanden

# checks.filename.label
source: Filename
de: Dateiname

# checks.filesize.label
source: Filesize
de: Dateigröße

# checks.dimensions.label
source: Dimensions
de: Abmessungen

# checks.mediaCredits.mediaId.label
source: Media ID
de: Medien ID

# checks.mediaCredits.mediaLink.label
source: Media Link
de: Medien Link

# checks.mediaCredits.author.label
source: Author
de: Urheber

# checks.mediaCredits.sourceOfSupply.label
source: Source of Supply
de: Bezugsquelle

# checks.dimensions.error
source: Image dimensions must be between <strong>{minWidth}&nbsp;x&nbsp;{minHeight}px</strong> and <strong>{maxWidth}&nbsp;x&nbsp;{maxHeight}px</strong>
de: Die Bildabmessungen müssen zwischen <strong>{minWidth}&nbsp;x&nbsp;{minHeight}px</strong> und <strong>{maxWidth}&nbsp;x&nbsp;{maxHeight}px</strong> liegen

# checks.fileName.error
source: The filename has to match the pattern <strong>"{allowedPattern}"</strong>
de: Der Dateiname muss dem Muster <strong>"{allowedPattern}"</strong> entsprechen

# checks.fileSize.fetchError
source: Could not resolve the file size
de: Die Dateigröße konnte nicht ermittelt werden

# checks.fileSize.error
source: File size must be less or equal than <strong>{maxSize} KB</strong>
de: Die Dateigröße muss kleiner oder gleich sein als <strong>{maxSize} KB</strong>

# checks.mediaCredits.mediaId.error
source: Media ID must be set
de: Angaben zur Medien ID müssen hinterlegt sein

# checks.mediaCredits.mediaLink.error
source: Media link must be set
de: Angaben zum Medien Link müssen hinterlegt sein

# checks.mediaCredits.author.error
source: Author must be set
de: Angaben zum Urheber müssen hinterlegt sein

# checks.mediaCredits.sourceOfSupply.error
source: Source of supply must be set
de: Angaben zur Bezugsquelle müssen hinterlegt sein

# checks.mediaCredits.fetchError
source: Could not resolve media credits
de: Die Bildnachweisdaten konnten nicht ermittelt werden

# checks.mediaCredits.info.label
source: Updating the data
de: Aktualisierung der Daten

# checks.mediaCredits.info
source: If the data has not been updated after changes were done, you can switch from this view to another module/tab, briefly select a different image or reload the page
de: Falls sich die Daten nach Änderung noch nicht aktualisiert haben, kann auf ein anderes Modul/einen anderen Tab gewechselt, kurzzeitig ein anderes Bild ausgewählt oder die Seite neu geladen werden, damit die Daten erneut abgefragt werden
